Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateRevealError Property
 Could not create Reveal. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateRevealError { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateRevealError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateRevealError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace